yongspan/GD32E230F8_Project/tools/GD32_ISP_CLI(Windows)_V5.1.0.39034/GD32_ISP_CLI(Windows)_V5.1.0.39034/OptionBytesXML/GD32M531.xml
				<description>FWDGT_PSC [2:0]&#x000A;Free watchdog timer prescaler selection.</description>
				<bitOffset>4</bitOffset>
				<bitWidth>3</bitWidth>
			</field>
			<field>
				<name>FWDGT_WND [3:0]</name>
				<brief>FWDGT_WND [3:0]</brief>
				<description>FWDGT_WND [3:0]&#x000A;The value of the free watchdog counter window value bit 3 to 0 in hardware start mode.</description>
				<bitOffset>0</bitOffset>
				<bitWidth>4</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>FWDGT_1_N</name>
		<displayName>FWDGT_1_N</displayName>
		<addressOffset>0x1B</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>FFFF</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>FWDGT_1_N</name>
				<brief>FWDGT_1 complement value</brief>
				<description>FWDGT_1 complement value</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>FWDGT_2</name>
		<displayName>FWDGT_2</displayName>
		<addressOffset>0x1C</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>FFFF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>FWDGT_WND [11:4]</name>
				<brief>FWDGT_WND [11:4]</brief>
				<description>FWDGT_WND [11:4]&#x000A;The value of the free watchdog counter window value bit 11 to 4 in hardware start mode.</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>FWDGT_2_N</name>
		<displayName>FWDGT_2_N</displayName>
		<addressOffset>0x1D</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>FFFF</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>FWDGT_2_N</name>
				<brief>FWDGT_2 complement value</brief>
				<description>FWDGT_2 complement value</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>FWDGT_3</name>
		<displayName>FWDGT_3</displayName>
		<addressOffset>0x1E</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>FFFF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>FWDGT_RLD [11:8]</name>
				<brief>FWDGT_RLD [11:8]</brief>
				<description>FWDGT_RLD [11:8]&#x000A;The value of the free watchdog timer counter reload value bit 11 to 8 in hardware start mode.</description>
				<bitOffset>0</bitOffset>
				<bitWidth>4</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>FWDGT_3_N</name>
		<displayName>FWDGT_3_N</displayName>
		<addressOffset>0x1F</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>FFFF</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>FWDGT_3_N</name>
				<brief>FWDGT_3 complement value</brief>
				<description>FWDGT_3 complement value</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
</OPBytes>
<OTPBytesBlocks>
    <OTPBlocks baseAddress="0x1FFF7000" length="512"/>
</OTPBytesBlocks>
<OTPBytes baseAddress="0x1FFF7000" length="512">
    <OTPBlocks>
        <name>OTP</name>
		<displayName>OTP</displayName>
        <minProgrammeWidth>0x20</minProgrammeWidth>
		<maxProgrammeWidth>0x40</maxProgrammeWidth>
		<eccsupport>128</eccsupport>
		<lockBaseAddress>0x0</lockBaseAddress>
		<BlockCnt>0x01</BlockCnt>
		<baseAddress>0x1FFF7000</baseAddress>
		<endAddress>0x1FFF71FF</endAddress>
        <fields>
		   <field>
                <name>OTP_Block</name>
				<displayName>OTP_Block</displayName>
                <baseAddress>0x1FFF7000</baseAddress>
		        <endAddress>0x1FFF71FF</endAddress>	
				<ifHasLockArea>0x0</ifHasLockArea>
				<size>0x200</size>
				<lockOffset>0x00</lockOffset>
				<lockbitWidth>0</lockbitWidth>
				<LockVal>0</LockVal>
            </field>
        </fields>
    </OTPBlocks>
</OTPBytes>